# 2. Написать функцию которая определит является ли введенная строка палиндромом
# (та которая читается одинаково с любой стороны), пример:
# ШАЛАШ, КАЗАК, ДЕД, ДОХОД, 13231 и т.д.

any_word = list(input('Введите любое слово: '))
#any_word = any_word.split()
#if any_word == any_word.reversed():
print(any_word.split())
# else:
#     print('no')
#if any_word ==
#any_index = len(any_word)


#for i in any_word:
 #    i ==
#print(any_index)
#next(


# def sravnenie():
#
#     print('Это слово палиндром!')
# else:
#     print('Это слово палиндром!')
