
# 2. Написать программу которая вернет количество введенных пользователем слов и общее число символов.
any_text=input('Введите текст: ')
print(len(any_text.split()))
print(len(any_text))

# Можно намутить через функции, но зачем??? А принты я разделил... )))